{
  "translations": {
    "en": {
      "sc1": "Consider searching for the record with key value 32 in this tree via contains(). We call the private contains helper method with a pointer to the BST root (the node with key value 37).",
      "sc2": "Check what <code>node</code> is pointing to. It is not null.",
      "sc3": "Check the value at the current node. We find that <code>value=32</code> is less than the value at the current node.",
      "sc4": "So we want to visit the left child.",
      "sc5": "We make a recursive call with the left child as the new <code>node</code>.",
      "sc6": "Check the value at the current node. We find that <code>value=32</code> is greater than the value at the current node.",
      "sc7": "So we want to visit the right child.",
      "sc9": "We make a recursive call with the right child as the new <code>node</code>.",
      "sc11": "Check the value at the current node. This is the record that we are looking for.",
      "sc12": "Now we will start unwinding the recursion, passing the return value <code>true</code> back up to the caller.",
      "sc13": "Pop the recursion, now <code>node</code> is back to the node with value 24.",
      "sc14": "Pop the recursion, now <code>node</code> is back to the node with value 37.",
      "sc15": "Pop the recursion one final time to return the return value <code>true</code> back to the original caller of contains().",
      "sc16": "Check the value at the current node. We find that it is not greater than what we are looking for.",
      "sc17": "Check the value at the current node. We find that it is not equal to what we are looking for."
    }
  },
  "code": {
    "java_generic": [{
      "url": "../../../SourceCode/Java_Generic/MHC/BinarySearchTree.java",
      "lineNumbers": false,
      "startAfter": "/* *** ODSATag: BSTcontains *** */",
      "endBefore": "/* *** ODSAendTag: BSTcontains *** */",
      "tags": {
        "sig": 2,
        "recursive": 5,
        "checknull": 7,
        "checklessthan": 16,
        "visitleft": 17,
        "checkequal": 11,
        "found": 12,
        "visitright": 22,
        "end": 24
      }
    }]
  }
}
